export interface ISlide {
    yearStart: number;
    yearEnd: number;
    name: string;
    events: {
        year: string;
        description: string;
    }[];
}

export const slides: ISlide[] = [
    {
        yearStart: 1990,
        yearEnd: 1993,
        name: 'Наука',
        events: [
            {
                year: '1990',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '1991',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: '1993',
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
        ],
    },
    {
        yearStart: 1994,
        yearEnd: 1999,
        name: 'Искусство',
        events: [
            {
                year: '1994',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '1995',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: '1996',
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
            {
                year: '1997',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '1998',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: '1999',
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
        ],
    },
    {
        yearStart: 2000,
        yearEnd: 2007,
        name: 'Образование',
        events: [
            {
                year: '2000',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '2002',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: '2004',
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
            {
                year: '2007',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
        ],
    },
    {
        yearStart: 2008,
        yearEnd: 2013,
        name: 'Литература',
        events: [
            {
                year: '2008',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '2009',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: '2013',
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
        ],
    },
    {
        yearStart: 2014,
        yearEnd: 2020,
        name: 'Культура',
        events: [
            {
                year: '2014',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '2015',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: '2016',
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
            {
                year: '2017',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '2020',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
        ],
    },
    {
        yearStart: 2021,
        yearEnd: 2024,
        name: 'Спорт',
        events: [
            {
                year: '2021',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
            {
                year: '2022',
                description:
                    'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                year: '2023',
                description:
                    'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
            },
            {
                year: '2024',
                description:
                    '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
            },
        ],
    },
];
